escaped_json/test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 1
      arrivalRate: 1
  processor: './processor.js'
scenarios:
  - flow:
    - get:
        url: /recipes/
        capture:
          - json: $
            as: recipes
    - post:
        url: /recipes/
        beforeRequest: "setJSONBody"